#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/WP-production/DevOps-DEV-Challenge-XVII/runs/run-RPeUsmv13qAga68B

Waiting for the plan to start...

Terraform v0.12.29
Configuring remote state backend...
Initializing Terraform configuration...
2020/11/28 15:31:56 [DEBUG] Using modified User-Agent: Terraform/0.12.29 TFC/50034a716d
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.user_data: Refreshing state...
module.wp-rds.data.aws_iam_policy_document.monitoring_rds_assume_role: Refreshing state...
data.aws_availability_zones.available: Refreshing state...
data.aws_ami.amazon_linux_ecs: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.wp_bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "wp_bucket_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:aws:s3:::wp-static-resources",
              + "arn:aws:s3:::wp-static-resources/*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::wp-static-resources/*",
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_alb.wordpress will be created
  + resource "aws_alb" "wordpress" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "wordpress"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_alb_listener.wordpress-http will be created
  + resource "aws_alb_listener" "wordpress-http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_alb_target_group.wordpress will be created
  + resource "aws_alb_target_group" "wordpress" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 30
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "wordpress"
      + port                               = 80
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200,301"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_db_parameter_group.aurora_db_57_parameter_group will be created
  + resource "aws_db_parameter_group" "aurora_db_57_parameter_group" {
      + arn         = (known after apply)
      + description = "wp-aurora-db-57-parameter-group"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "wp-aurora-db-57-parameter-group"
      + name_prefix = (known after apply)
    }

  # aws_ecs_service.wordpress will be created
  + resource "aws_ecs_service" "wordpress" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "wordpress"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = "wordpress"

      + load_balancer {
          + container_name   = "wordpress"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + ordered_placement_strategy {
          + field = "instanceId"
          + type  = "spread"
        }
    }

  # aws_ecs_task_definition.wordpress will be created
  + resource "aws_ecs_task_definition" "wordpress" {
      + arn                   = (known after apply)
      + container_definitions = (known after apply)
      + family                = "wordpress"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
    }

  # aws_rds_cluster_parameter_group.aurora_57_cluster_parameter_group will be created
  + resource "aws_rds_cluster_parameter_group" "aurora_57_cluster_parameter_group" {
      + arn         = (known after apply)
      + description = "wp-aurora-57-cluster-parameter-group"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "wp-aurora-57-cluster-parameter-group"
      + name_prefix = (known after apply)
    }

  # aws_security_group.allow_all_http_https will be created
  + resource "aws_security_group" "allow_all_http_https" {
      + arn                    = (known after apply)
      + description            = "Security Group which allows HTTP and HTTPS traffic from anywhere"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "Allow all HTTP HTTPS"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "prod"
          + "Name"        = "Allow all HTTP HTTPS"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.allow_traffic will be created
  + resource "aws_security_group" "allow_traffic" {
      + arn                    = (known after apply)
      + description            = "Security Group for internal access and outbound connections"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "Allow Internal and outbound traffic"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "prod"
          + "Name"        = "Allow Internal and outbound traffic"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ec2_profile.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "wp_ecs_instance_profile"
      + path        = "/"
      + role        = "wp_ecs_instance_role"
      + unique_id   = (known after apply)
    }

  # module.ec2_profile.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wp_ecs_instance_role"
      + path                  = "/ecs/"
      + unique_id             = (known after apply)
    }

  # module.ec2_profile.aws_iam_role_policy_attachment.ecs_ec2_cloudwatch_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_ec2_cloudwatch_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
      + role       = (known after apply)
    }

  # module.ec2_profile.aws_iam_role_policy_attachment.ecs_ec2_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_ec2_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "wp"

      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.this.aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 300
      + desired_capacity          = 1
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_elb_capacity          = 0
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "wp-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "Default",
        ]
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "0"

      + tag {
          + key                 = "Cluster"
          + propagate_at_launch = true
          + value               = "wp"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "prod"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "wp"
        }
    }

  # module.this.aws_launch_configuration.this[0] will be created
  + resource "aws_launch_configuration" "this" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = false
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-0c8cd0f8228906ee4"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "wp-"
      + placement_tenancy           = "default"
      + security_groups             = (known after apply)
      + user_data                   = "dfeaadf73a479a40d74a27e87cb4cea28480dcbb"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.wp-rds.aws_appautoscaling_policy.autoscaling_read_replica_count[0] will be created
  + resource "aws_appautoscaling_policy" "autoscaling_read_replica_count" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "target-metric"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "cluster:wp-rds"
      + scalable_dimension = "rds:cluster:ReadReplicaCount"
      + service_namespace  = "rds"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "RDSReaderAverageCPUUtilization"
            }
        }
    }

  # module.wp-rds.aws_appautoscaling_target.read_replica_count[0] will be created
  + resource "aws_appautoscaling_target" "read_replica_count" {
      + id                 = (known after apply)
      + max_capacity       = 5
      + min_capacity       = 1
      + resource_id        = "cluster:wp-rds"
      + role_arn           = (known after apply)
      + scalable_dimension = "rds:cluster:ReadReplicaCount"
      + service_namespace  = "rds"
    }

  # module.wp-rds.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "For Aurora cluster wp-rds"
      + id          = (known after apply)
      + name        = "wp-rds"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "aurora-wp-rds"
        }
    }

  # module.wp-rds.aws_rds_cluster.this will be created
  + resource "aws_rds_cluster" "this" {
      + apply_immediately                   = true
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backtrack_window                    = 0
      + backup_retention_period             = 7
      + cluster_identifier                  = "wp-rds"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = false
      + database_name                       = (known after apply)
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = "wp-rds"
      + deletion_protection                 = false
      + enable_http_endpoint                = false
      + enabled_cloudwatch_logs_exports     = [
          + "audit",
          + "error",
          + "slowquery",
        ]
      + endpoint                            = (known after apply)
      + engine                              = "aurora-mysql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "5.7.12"
      + final_snapshot_identifier           = (known after apply)
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = false
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = "admin"
      + port                                = 3306
      + preferred_backup_window             = "02:00-03:00"
      + preferred_maintenance_window        = "sun:05:00-sun:06:00"
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = true
      + storage_encrypted                   = true
      + vpc_security_group_ids              = (known after apply)
    }

  # module.wp-rds.aws_rds_cluster_instance.this[0] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = "rds-ca-2019"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = false
      + db_parameter_group_name         = (known after apply)
      + db_subnet_group_name            = "wp-rds"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_version                  = "5.7.12"
      + id                              = (known after apply)
      + identifier                      = "wp-rds-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t2.small"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 0
      + monitoring_role_arn             = (known after apply)
      + performance_insights_enabled    = false
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + promotion_tier                  = 1
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + writer                          = (known after apply)
    }

  # module.wp-rds.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "wp-rds-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "aurora-wp-rds"
        }
      + vpc_id                 = (known after apply)
    }

  # module.wp-rds.random_id.snapshot_identifier will be created
  + resource "random_id" "snapshot_identifier" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "wp-rds"
        }
    }

  # module.wp-rds.random_password.master_password will be created
  + resource "random_password" "master_password" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.wp-vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-eu-central-1a"
          + "Terraform"   = "true"
        }
      + vpc               = true
    }

  # module.wp-vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.wp-vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-eu-central-1a"
          + "Terraform"   = "true"
        }
    }

  # module.wp-vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.wp-vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.wp-vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-private"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.wp-vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-public"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.wp-vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.wp-vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.wp-vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.wp-vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.wp-vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.wp-vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.wp-vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-private-eu-central-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.wp-vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-private-eu-central-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.wp-vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-private-eu-central-1c"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.wp-vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-public-eu-central-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.wp-vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.5.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-public-eu-central-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.wp-vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.6.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc-public-eu-central-1c"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.wp-vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Name"        = "wp-vpc"
          + "Terraform"   = "true"
        }
    }

  # module.wp_s3_iam.aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "wp-s3"
    }

  # module.wp_s3_iam.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "wp-s3"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.wp_static_resources_s3.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "wp-static-resources"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "Wordpress"
          + "Environment" = "prod"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.wp_static_resources_s3.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.wp_static_resources_s3.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 49 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @m1fpv, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Test`*